zoubata/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA





# ZoubWorld Pilo rev A0
zoubworld_Pilo.name=zoubworld Pilo (rev A0)
zoubworld_Pilo.name=Arduino M0
zoubworld_Pilo.vid.0=0x2a03
zoubworld_Pilo.pid.0=0x004d
zoubworld_Pilo.vid.1=0x2a03
zoubworld_Pilo.pid.1=0x804d
zoubworld_Pilo.vid.2=0x2a03
zoubworld_Pilo.pid.2=0x004e
zoubworld_Pilo.vid.3=0x2a03
zoubworld_Pilo.pid.3=0x804e
zoubworld_Pilo.build.mcu=cortex-m0plus
zoubworld_Pilo.build.f_cpu=48000000L
zoubworld_Pilo.build.board=SAMD_ZERO
zoubworld_Pilo.build.core=arduino
zoubworld_Pilo.build.variant=Pilo
zoubworld_Pilo.build.variant_system_lib=
zoubworld_Pilo.upload.protocol=sam-ba
zoubworld_Pilo.bootloader.tool=arduino:openocd
zoubworld_Pilo.menu.clock.crystal_32k=32KHZ_CRYSTAL
zoubworld_Pilo.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
zoubworld_Pilo.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
zoubworld_Pilo.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
zoubworld_Pilo.menu.clock.internal=INTERNAL_OSCILLATOR
zoubworld_Pilo.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
zoubworld_Pilo.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
zoubworld_Pilo.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
zoubworld_Pilo.menu.cpu.samc21e18a=SAMC21E18A
zoubworld_Pilo.menu.cpu.samc21e18a.upload.maximum_size=253952
zoubworld_Pilo.menu.cpu.samc21e18a.build.extra_flags=-D__SAMC21E18A__ {build.usb_flags}
zoubworld_Pilo.menu.cpu.samc21e18a.build.ldscript=flash_256KB.ld
zoubworld_Pilo.menu.cpu.samc21e18a.build.openocdscript=openocd_scripts/SAMC21E18A.cfg
zoubworld_Pilo.menu.cpu.samc21e18a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMC21J18A.bin
zoubworld_Pilo.menu.cpu.samc21e17a=SAMC21E17A
zoubworld_Pilo.menu.cpu.samc21e17a.upload.maximum_size=122880
zoubworld_Pilo.menu.cpu.samc21e17a.build.extra_flags=-D__SAMC21E17A__ {build.usb_flags}
zoubworld_Pilo.menu.cpu.samc21e17a.build.ldscript=flash_128KB.ld
zoubworld_Pilo.menu.cpu.samc21e17a.build.openocdscript=openocd_scripts/SAMC21E17A.cfg
zoubworld_Pilo.menu.cpu.samc21e17a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMC21J17A.bin
zoubworld_Pilo.menu.cpu.samc21e16a=SAMC21E16A
zoubworld_Pilo.menu.cpu.samc21e16a.upload.maximum_size=57344
zoubworld_Pilo.menu.cpu.samc21e16a.build.extra_flags=-D__SAMC21E16A__ {build.usb_flags}
zoubworld_Pilo.menu.cpu.samc21e16a.build.ldscript=flash_64KB.ld
zoubworld_Pilo.menu.cpu.samc21e16a.build.openocdscript=openocd_scripts/SAMC21E16A.cfg
zoubworld_Pilo.menu.cpu.samc21e16a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMC21J16A.bin
zoubworld_Pilo.menu.cpu.samc21e15a=SAMC21E15A
zoubworld_Pilo.menu.cpu.samc21e15a.upload.maximum_size=24576
zoubworld_Pilo.menu.cpu.samc21e15a.build.extra_flags=-D__SAMC21E15A__ {build.usb_flags}
zoubworld_Pilo.menu.cpu.samc21e15a.build.ldscript=flash_32KB.ld
zoubworld_Pilo.menu.cpu.samc21e15a.build.openocdscript=openocd_scripts/SAMC21E15A.cfg
zoubworld_Pilo.menu.cpu.samc21e15a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMC21J15A.bin
zoubworld_Pilo.menu.bootloader.8kb=8KB_BOOTLOADER
zoubworld_Pilo.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
zoubworld_Pilo.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
zoubworld_Pilo.menu.bootloader.8kb.upload.tool=Zoubworld_Arduino:bossac
zoubworld_Pilo.menu.bootloader.8kb.upload.use_1200bps_touch=true
zoubworld_Pilo.menu.bootloader.8kb.upload.wait_for_upload_port=true
zoubworld_Pilo.menu.bootloader.8kb.upload.native_usb=true
zoubworld_Pilo.menu.bootloader.16kb=16KB_BOOTLOADER
zoubworld_Pilo.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
zoubworld_Pilo.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
zoubworld_Pilo.menu.bootloader.16kb.upload.tool=Zoubworld_Arduino:bossac
zoubworld_Pilo.menu.bootloader.16kb.upload.use_1200bps_touch=true
zoubworld_Pilo.menu.bootloader.16kb.upload.wait_for_upload_port=true
zoubworld_Pilo.menu.bootloader.16kb.upload.native_usb=true
zoubworld_Pilo.menu.bootloader.0kb=NO_BOOTLOADER
zoubworld_Pilo.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
zoubworld_Pilo.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
zoubworld_Pilo.menu.bootloader.0kb.upload.tool=arduino:openocd
zoubworld_Pilo.menu.bootloader.0kb.upload.use_1200bps_touch=false
zoubworld_Pilo.menu.bootloader.0kb.upload.wait_for_upload_port=false
zoubworld_Pilo.menu.bootloader.0kb.upload.native_usb=false
zoubworld_Pilo.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
zoubworld_Pilo.menu.serial.one_uart.build.serialcom_uart=ONE_UART
zoubworld_Pilo.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
zoubworld_Pilo.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi=ONE_UART_TWO_WIRE_ONE_SPI
zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
zoubworld_Pilo.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
zoubworld_Pilo.menu.serial.two_uart.build.serialcom_uart=TWO_UART
zoubworld_Pilo.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
zoubworld_Pilo.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi=THREE_UART_ONE_WIRE_NO_SPI
zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi=THREE_UART_NO_WIRE_ONE_SPI
zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
zoubworld_Pilo.menu.serial.four_uart=FOUR_UART_NO_WIRE_NO_SPI
zoubworld_Pilo.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
zoubworld_Pilo.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
zoubworld_Pilo.menu.serial.four_uart.build.serialcom_spi=NO_SPI
zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi=NO_UART_ONE_WIRE_TWO_SPI
zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi=FOUR_UART_ONE_WIRE_ONE_SPI (L21 only)
zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi.build.serialcom_uart=FOUR_UART
zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi.build.serialcom_wire=ONE_WIRE
zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi.build.serialcom_spi=ONE_SPI
zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi=FIVE_UART_NO_WIRE_ONE_SPI (L21 only)
zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi.build.serialcom_uart=FIVE_UART
zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi=FIVE_UART_ONE_WIRE_NO_SPI (L21 only)
zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi.build.serialcom_uart=FIVE_UART
zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
zoubworld_Pilo.menu.serial.six_uart=SIX_UART_NO_WIRE_NO_SPI (L21 only)
zoubworld_Pilo.menu.serial.six_uart.build.serialcom_uart=SIX_UART
zoubworld_Pilo.menu.serial.six_uart.build.serialcom_wire=NO_WIRE
zoubworld_Pilo.menu.serial.six_uart.build.serialcom_spi=NO_SPI
zoubworld_Pilo.menu.usb.cdc=CDC_ONLY
zoubworld_Pilo.menu.usb.cdc.build.usbcom=CDC_ONLY
zoubworld_Pilo.menu.usb.cdc.build.pid=0x0557
zoubworld_Pilo.menu.usb.cdc_hid=CDC_HID
zoubworld_Pilo.menu.usb.cdc_hid.build.usbcom=CDC_HID
zoubworld_Pilo.menu.usb.cdc_hid.build.pid=0x0856
zoubworld_Pilo.menu.usb.withcdc=WITH_CDC
zoubworld_Pilo.menu.usb.withcdc.build.usbcom=WITH_CDC
zoubworld_Pilo.menu.usb.withcdc.build.pid=0x0B41
zoubworld_Pilo.menu.usb.hid=HID_ONLY
zoubworld_Pilo.menu.usb.hid.build.usbcom=HID_ONLY
zoubworld_Pilo.menu.usb.hid.build.pid=0x0B40
zoubworld_Pilo.menu.usb.nocdc=WITHOUT_CDC
zoubworld_Pilo.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
zoubworld_Pilo.menu.usb.nocdc.build.pid=0x0A0C
zoubworld_Pilo.menu.usb.none=USB_DISABLED
zoubworld_Pilo.menu.usb.none.build.usbcom=USB_DISABLED
zoubworld_Pilo.menu.usb.none.build.pid=0x0856

